
## Terraform plan for environment: `int`

**Commit:** 9caded83490876d008ad38073ffa85744181d7a0


**API version:** release-v5.16.0
**CLI version:** release-v5.16.0
**Selfserve version:** release-v5.16.0
**Internal version:** release-v5.16.0
**search version:** 0ad6cd4830

### Plan summary

`1 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-int-batch-failure-email-olcs-dev"]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-int-batch-failure-email-olcs-dev"] will be created
  + resource "aws_sns_topic_subscription" "this" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "olcs-dev@otc.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-1:054614622558:vol-app-int-batch-failure-topic-20241009140715202500000002"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>